def filter_adc_signal(raw_data):
    filtered_raw = [] #пустой список, который используеся для отсортированных значений
    for i in raw_data: #цикл перебирает значения в списке
        if i == 1023 or i == 0: #проверка равно ли число внутри списка 1023 или 0
            continue 
        filtered_raw.append(i) #добавляем отсортированные значения
    
    return filtered_raw #возвращаем список

raw_data = [] #пустой список, в котором будут неотсортированные значения
a = int(input('Сколько значений в вашем списке?')) #спрашиваем у пользователя количество значений
for i in range(a): #цикл, позволяющий вносить пользователю значения в список
    raw_data.append(int(input(f"Введите значение {i+1} ")))

print(raw_data) #вывод списка для проверки
filtered = filter_adc_signal(raw_data) #присваиваем новой переменной значения из функции
print(f'Отсортиванный список {filtered}') #вывод отфильтрованного списка из функции
print(f'Среднее значение {sum(filtered)/len(filtered)}') #вывод среднего значения отфильтрованного списка

